Revit 2024 API
WorksetConfiguration Class
 A configuration class that is passed in to methods that open Revit documents to specify which user-created worksets are opened/closed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class WorksetConfiguration : IDisposable
Visual Basic
Public Class WorksetConfiguration _
	Implements IDisposable
Visual C++
public ref class WorksetConfiguration : IDisposable
Remarks
Once an instance of this class is created, it can be further modified by calling any of the other methods in any order. It is a specification of a setting for model open; the methods of this class just adjust the specification, and do not themselves open or close worksets.
Only user-created worksets can be specified to be opened or closed. All system worksets are automatically open. An open workset allows its elements can be expanded and displayed. For a closed workset, Revit tries to not expand its elements, and to that end, does not display them. This is intended to help with performance by reducing Revit's memory footprint.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.WorksetConfiguration
See Also
WorksetConfiguration Members
Autodesk.Revit.DB Namespace